Revit 2027 API
DockablePane.PaneIsRegistered Method
 Returns true if %id% refers to a built-in Revit dockable pane, or an add-in pane that has been properly registered with %Autodesk.Revit.UI.UIApplication.RegisterDockablePane%.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool PaneIsRegistered(
	DockablePaneId id
)
Public Shared Function PaneIsRegistered (
	id As DockablePaneId
) As Boolean
public:
static bool PaneIsRegistered(
	DockablePaneId^ id
)
static member PaneIsRegistered :
        id : DockablePaneId -> bool
Parameters
id DockablePaneId
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace